# DML (Data Manipulation Language, 데이터 조작어)

### Connect to DataBase (MySQL)

In [1]:
%load_ext sql

%sql mysql+pymysql://Choonsik:malrangcow@localhost:3306/sqld

### INSERT
테이블에 데이터를 입력/추가하는 명령어
PK나 NOT NULL 제약조건이 걸린 컬럼에는 NULL값을 넣을 수 없으므로 주의

### INSERT INTO tablename (columnname1, columnname2, ...) VALUES (data1, data2, ...);

In [2]:
%%sql

CREATE TABLE user (
    id INT PRIMARY KEY,
    email VARCHAR(40),
    password VARCHAR(30)
);

INSERT INTO user (id, email, password) 
VALUES (1, 'malrangcow00@gmail.com', 'malrangcow')
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
0 rows affected.
1 rows affected.

[]

In [3]:
%%sql df <<

SELECT * 
FROM user
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
1 rows affected.
Returning data to local variable df

In [4]:
import pandas as pd

df = pd.DataFrame(df)
df

   id                   email    password
0   1  malrangcow00@gmail.com  malrangcow

### INSERT INTO tablename VALUES (data1, data2, ...);

In [5]:
%%sql

INSERT INTO user
VALUES (2, 'choonsik@kakaofriends.com', 'choonsik')
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
1 rows affected.

[]

In [6]:
%%sql df <<

SELECT *
FROM user
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
2 rows affected.
Returning data to local variable df

In [7]:
df = pd.DataFrame(df)
df

   id                      email    password
0   1     malrangcow00@gmail.com  malrangcow
1   2  choonsik@kakaofriends.com    choonsik

If id is AUTO_INCREMENT, you don't need to insert id.
but cannot omit column name.

In [8]:
%%sql

CREATE TABLE new_user (
    id INT PRIMARY KEY AUTO_INCREMENT,
    email VARCHAR(40),
    password VARCHAR(30)
);

INSERT INTO new_user (email, password) 
VALUES ('malrangcow00@gmail.com', 'malrangcow')
;

INSERT INTO new_user (email, password)
VALUES ('choonsik@kakaofriends.com', 'choonsik')
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
0 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql df <<

SELECT *
FROM new_user
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
2 rows affected.
Returning data to local variable df

In [10]:
df = pd.DataFrame(df)
df

   id                      email    password
0   1     malrangcow00@gmail.com  malrangcow
1   2  choonsik@kakaofriends.com    choonsik

### UPDATE
테이블에 있는 데이터를 수정하는 명령어
WHERE절을 사용하여 조건을 걸어주지 않으면 모든 데이터가 수정된다.

### UPDATE tablename SET columnname1 = data1, columnname2 = data2, ... WHERE condition;

In [11]:
%%sql

UPDATE user
SET 
email = 'choonsik00@kakaofriends.com',
password = 'malrangcow'
WHERE id = 2
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
1 rows affected.

[]

In [12]:
%%sql df <<

SELECT *
FROM user
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
2 rows affected.
Returning data to local variable df

In [13]:
df = pd.DataFrame(df)
df

   id                        email    password
0   1       malrangcow00@gmail.com  malrangcow
1   2  choonsik00@kakaofriends.com  malrangcow

### DELETE
테이블에 있는 데이터를 삭제하는 명령어
WHERE절 조건이 없으면 모든 데이터가 삭제되므로 반드시 주의 !
삭제하려는 의도라면 시스템 부하 측면에서 TRUNCATE TABLE(DDL)을 사용하는 것이 좋다.

### DELETE FROM tablename WHERE condition;

In [14]:
%%sql

DELETE FROM user
WHERE id = 2
;

DELETE FROM new_user
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
1 rows affected.
2 rows affected.

[]

In [15]:
%%sql df <<

SELECT *
FROM user
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
1 rows affected.
Returning data to local variable df

In [16]:
df = pd.DataFrame(df)
df

   id                   email    password
0   1  malrangcow00@gmail.com  malrangcow

### MERGE
두 개의 테이블을 하나로 합치는 명령어
테이블에 새로운 데이터를 입력하거나 이미 저장되어 있는 데이터에 대한 변경 작업을 한 번에 처리
&rarr; 즉, INSERT, UPDATE, DELETE를 함축시킨 작업이다.
😿 MySQL은 MERGE 명령어를 지원하지 않는다.

```sql
MERGE
INTO target_table alias
    USING source_table alias
    ON condition
    WHEN MATCHED THEN
        UPDATE 
            SET columnname1 = newdata1, columnname2 = newdata2, ...
    WHEN NOT MATCHED THEN
        INSERT (columnname1, columnname2, ...)
        VALUES (data1, data2, ...);
```

also can update and insert partial data by using WHERE condition in SELECT statement.

### USING (SELECT * FROM source_table WHERE condition) alias

by the case, you can choose WHEN MATCHED or WHEN NOT MATCHED statement and use one of them.

In [17]:
%%sql

INSERT INTO new_user (email, password)
SELECT email, password FROM user
ON DUPLICATE KEY UPDATE email = VALUES(email), password = VALUES(password)
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
1 rows affected.

[]

In [18]:
%%sql df <<

SELECT *
FROM user
;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
1 rows affected.
Returning data to local variable df

In [19]:
df = pd.DataFrame(df)
df

   id                   email    password
0   1  malrangcow00@gmail.com  malrangcow

PK AUTO_INCREMENT !!

In [20]:
%%sql

DROP TABLE new_user;

DROP TABLE user;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
0 rows affected.
0 rows affected.

[]